package test;

public class IdentifierEx {
/*			!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!식별자 규칙!!!!!!!!!!!!!!!!!!!!!!!!!!
 * 반드시 지켜야할것(안지키면 에러)
 * - 숫자로 시작하면 안됨
 * - 특수문자는 '_','$' 이외 사용불가
 * - 예약어 사용불가(ex. class, void 등등)
 * 
 * 
 * 개발자간 지켜야할 것(에러는 안나지만 개발자라면 지켜야함)
 * - 의미에 맞게 작성
 * - 너무축약하면 안됨
 * - 각 식별자에 따라서 규칙을 반드시 지켜야함(클래스, 상수, 변수, 메소드, 생성자)
 * 
 * 식별자(이름규칙)
 * - 클래스 : 첫글자 대문자 / 낙타표기법 (ex : Test, SuperMan )
 * - 변수 :  첫글자 소문자 / 낙타표기법 (ex : test, superMan )
 * - 상수 : 전부대문자 (ex : TEST, SUPER_MAN )
 * - 메소드 : 변수규칙과 동일 뒤에 괄호 입력(ex : text(), superMan() )
 * - 생성자 : 클래스 생성규칙과 동일 (ex : Test(), SuperMan() )
 */
	
	/*			!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!자료형!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
	 * 1) 기본자료형(Primitive Type)
	 * 		- 논리형
	 * 			-> boolean
	 * 		- 문자형
	 * 			-> char 
	 * 		- 정수형
	 * 			-> byte
	 * 			-> short
	 * 			-> int
	 * 			-> long
	 * 		- 실수형
	 *			-> float
	 *			-> double
	 * 2) 객체자료형(Reference Type)
	 * 		- 문자열형
	 * 			-> String
	 */
}// IdentifierEx end
